cases/wedge/constant/contactAngleProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      contactAngleProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

contactLine
{
    // option 1: prescribe a single model that is used for adv and rec
    type    constant;
    staticContactAngle  90;

//    // option 2: specify both, advancing and receding models
//    type advancingContactAngleModel;
//    advancingContactAngleModel
//    {
//        type                constant;
//        staticContactAngle  30;
//    }
//    recedingContactAngleModel
//    {
//        type                constant;
//        staticContactAngle  30;
//    }

//    // option 3: mesh dependent contact angle model as in Afkhami et al, 2009
//    type    meshDependent;
//    K       0.2; // 0.2 is the default if K parameter is omitted
//    appContactAngleModel 
//    {
//        type    constant;
//        staticContactAngle 30;
//    }
}

// ************************************************************************* //
