cases/wedge/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

matchTolerance 1E-3;

pointSync true;

patchInfo
(

	{
		name freeSurface;

		// type of the new patch
		dictionary
		{
			type patch;
		}
		
		constructFrom set;
		set freeSurface;
	}
	
	{
		name side;

		// type of the new patch
		dictionary
		{
			type patch;
		}
		
		constructFrom set;
		set sides_faces;
	}

	{
		name bottom;

		// type of the new patch
		dictionary
		{
			type patch;
		}
		
		constructFrom set;
		set bottom;
	}
		

);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
