cases/wedge/system/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward; //Euler;
}

gradSchemes
{
    default         faceLimited leastSquares 0.5; // Grad: Us, surfaceTension
}

divSchemes
{
    default         none; 
    div(Us)         Gauss Gamma 0.3 magLe; //linearUpwind magLe; //-HM linear?
    div(phis,CsCis)    Gauss Gamma 0.3; //upwind; // linear; linearUpwind; upwind;
    div(phis,CsTrans)    Gauss Gamma 0.3; //upwind; // linear; linearUpwind; upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected; // Laplacian: (surfaceDiffusionCoeff,Cs)
}

interpolationSchemes
{
    default         linear; // Interpolate: Us
}

snGradSchemes
{
    default         none; // uncorrected;
}

// ************************************************************************* //
