cases/wedge/system/faSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      faSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    CsTrans
    {
        solver          PBiCG;
        preconditioner  DILU;
        minIter         4;
        maxIter         2000;
        tolerance       1e-18;
        relTol          0;
    }

    CsCis
    {
        solver          PBiCG;
        preconditioner  DILU;
        minIter         4;
        maxIter         2000;
        tolerance       1e-18;
        relTol          0;
    }
}

// ************************************************************************* //
